using System;

public class CPHInline
{

    public string[] primaryCards = [
        "The Fool หมายถึง การเริ่มต้นอะไรใหม่ๆ การเสี่ยงอันตราย หากว่าเปิดได้ไพ่ใบนี้แล้วล่ะก็ เส้นทางใหม่ที่จะเดินไปอาจมีความเสี่ยง แต่เป็นความเสี่ยงที่ตัวเองต้องการ รู้ว่าเสี่ยงแต่คงต้องขอลอง",
        "The Magician หมายถึง ความทะเยอทะยาน การลงมือทำ ไพ่บอกว่าตัวคุณเองว่าคุณเก่งมาก อยากทำอะไรก็ลุยให้เต็มที่เลย เพราะไฟในตัวมีเยอะพอๆ กับความสามารถ ดังนั้นลุยได้เลยไม่ต้องยั้ง",
        "The High Priestess หมายถึง ความฉลาด มีความรู้ความสามารถ เป็นตัวแทนของคนเก่งมากความสามารถ แต่มักซ่อนสิ่งนั้นเอาไว้ภายในรูปลักษณ์นิ่งเงียบที่แสดงให้ภายนอกได้เห็น",
        "The Empress หมายถึง ความอุดมสมบูรณ์ ความเป็นแม่ เปิดได้ไพ่ใบนี้บอกเลยว่าจะเจอแต่ความสุขความสบาย เงินทองมั่งมี หรืออาจหมายถึงโอกาสตั้งครรภ์ได้ด้วย",
        "The Emperor หมายถึง การมีอำนาจ ชอบสั่ง และไม่ยอมใคร คุณอาจอยู่ในสถานการณ์ที่ต้องยอมทำตามผู้ใหญ่ ถูกบังคับจากคนมีอำนาจมากกว่าก็เป็นได้ และยังหมายถึงความมั่นคงได้อีกด้วย",
        "The Hierophant หมายถึง การมีความรู้ การแต่งงาน การรวมเป็นหนึ่ง พระคือตัวแทนของผู้มีความรู้และยังเป็นตัวแทนในการแต่งงานรวมเป็นครอบครัวเดียวกัน อาจหมายถึงการเป็นที่พึ่งพาของคนอื่นๆ",
        "The Lovers หมายถึง ความรัก การตัดสินใจ ได้พบเจอความรัก หรือต้องตัดสินใจเลือกสิ่งใดสิ่งหนึ่ง",
        "The Chariot หมายถึง ความแน่วแน่ มุ่งมั่น ขยัน ทุ่มเท เมื่อเจอไพ่ใบนี้ คุณต้องทำตัวให้แข็งแกร่งยิ่งกว่าม้าศึกถึงจะประสบความสำเร็จในสิ่งที่ทำ",
        "Strength หมายถึง ความแข็งแกร่ง บริหารจัดการเก่ง ไพ่นี้คือตัวแทนของหญิงสาวสุดแกร่ง มีอะไรเข้ามาก็ไม่อาจทำอะไรเธอได้ แถมยังจัดการสิ่งต่างๆ ได้เป็นอย่างดีอีกด้วย",
        "The Hermit หมายถึง ความสันโดษ โดดเดี่ยว วิเคราะห์ เมื่อเจอไพ่ใบนี้ก็คงเลี่ยงไม่พ้นการอยู่ตัวคนเดียว การใช้เวลารักษาเยียวยาจิตใจ หรือแม้แต่การใช้เวลาเพื่อคิดวิเคราะห์สิ่งต่างๆ รอบตัว อย่าได้ใจร้อนทำสิ่งใดเด็ดขาด",
        "The Wheel of Fortune หมายถึง โชคชะตา เปลี่ยนแปลง คุณต้องเตรียมตัวให้ดี เพราะมีโอกาสเกิดเรื่องที่ไม่คาดฝันได้ มีการเปลี่ยนแปลงที่เราไม่อาจขัดขวางได้ อาจจะเป็นเรื่องดีหรือไม่ดีก็ได้เช่นกัน",
        "Justice หมายถึง การตัดสินใจ เท่าเทียม กฎหมาย หากเปิดเจอไพ่นี้แสดงว่าคุณจะได้รับความยุติธรรม มีการตัดสินใจที่ก่อให้เกิดความเท่าเทียม หรืออาจจะเจอกับเรื่องราวเกี่ยวกับกฎหมายก็ได้เช่นกัน",
        "The Hanged Man หมายถึง การรอคอย เสียสละ คุณอาจได้เจอกับสถานการณ์ที่ไม่อาจตัดสินใจทำอะไรได้ ต้องอยู่นิ่งๆ ต้องรอคอย หรืออาจจะต้องเสียสละความสุขส่วนตัวบางอย่าง",
        "Death หมายถึง การเปลี่ยนแปลง เกิดใหม่ เรื่องร้ายๆ จะกลายเป็นดี สิ่งต่างๆ ที่ว่าร้ายแรงแล้วจะเริ่มเปลี่ยนแปลงไปในทางที่ดีขึ้นทีละนิด",
        "Temperance หมายถึง การต่อรอง ผสมผสาน สมดุล ไพ่อยากแนะนำให้คุณสร้างความสมดุลให้ชีวิต ต้องต่อรองและยอมอ่อนข้อบ้างเพื่อให้ได้สิ่งที่ต้องการ",
        "The Devil หมายถึง การควบคุม ผูกมัด ไร้ความหวัง ระวังให้ดี เมื่อไพ่ใบนี้ปรากฏขึ้นมา เพราะคุณอาจเจอกับการควบคุม ถูกผูกมัดโดยไม่เต็มใจจนทำให้หมดพลังใจและหมดความหวัง",
        "The Tower หมายถึง การเปลี่ยนแปลงกะทันหัน การทะเลาะเบาะแว้ง ต้องเตรียมใจให้ดี เพราะอาจเจอเรื่องไม่คาดฝัน ได้รับข่าวสารที่ไม่ทันได้เตรียมใจ หรือเกิดเรื่องบาดหมางใหญ่โตกับคนรอบตัว",
        "The Star หมายถึง ความหวัง ความสงบ แม้ฟ้าจะมืดมิด แต่หากไพ่ใบนี้โผล่ขึ้นมาก็เหมือนกับมีความหวังจากดวงดาวปรากฏขึ้น ควรทำตัวให้สงบเยือกเย็นเอาไว้",
        "The Moon หมายถึง ความกลัว ภาพลวงตา บางครั้งความกลัวก็อาจคืบคลานเข้ามาหาคุณแบบไม่รู้ตัว แต่ไพ่อาจบอกให้พิจารณาให้ดีว่าสิ่งนั้นน่ากลัวจริงๆ หรือเป็นเพียงภาพลวงตา",
        "The Sun หมายถึง การเติบโต แสงสว่าง มีชีวิตชีวา ไพ่ที่เป็นตัวแทนของความร้อนแรงและสดใส และเร็วๆ นี้อาจมีเรื่องดีๆ เข้ามาเซอร์ไพรส์ก็เป็นได้",
        "Judgement หมายถึง การตัดสินใจ โอกาสครั้งที่สอง จะมีเรื่องสำคัญมากๆ เข้ามาให้ต้องตัดสินใจ ต้องปล่อยอดีตให้ผ่านไปเพื่อให้สิ่งใหม่ๆ ได้เข้ามาแทน",
        "The World หมายถึง ความสำเร็จ ความสมบูรณ์ ถือเป็นอีกหนึ่งใบดีๆ อีกหนึ่งใบ มีความสำเร็จเกิดขึ้น ชีวิตเติมเต็มมากๆ ด้วย"
    ];

    public string[] secondaryCards = [
        "Ace of Cups หมายถึง ความรัก การเริ่มต้น การมอบสิ่งดีๆ ให้กับอีกฝ่ายหรืออาจจะเป็นฝ่ายได้รับสิ่งดีๆ จากผู้อื่น",
        "Two of Cups หมายถึง คนรัก คู่รัก การมอบความรักให้กันและกัน ถ้าชอบใครอยู่อาจมีโอกาสสมหวัง",
        "Three of Cups หมายถึง การเฉลิมฉลอง ปาร์ตี้กับเพื่อนๆ มีความรักแบบเพื่อนฝูง แฮปปี้มีความสุข",
        "Four of Cups หมายถึง การหยุดนิ่ง ความเบื่อหน่าย แม้จะมีความสุข มีสิ่งดีๆ รายล้อม แต่กลับเบื่อหน่ายเพราะอยู่แต่ในกรอบเดิมๆ",
        "Five of  Cups หมายถึง การสูญเสีย ความเศร้า เหมือนถ้วยที่ล้มลง ความรู้สึกสิ้นหวัง ความหวังพังทลาย",
        "Six of Cups หมายถึง ความสงบสุข มีคนมาเยี่ยม อาจได้รับเซอร์ไพรส์จากคนอื่น มีการมาหาแบบไม่ทันตั้งตัว ได้รับของฝาก",
        "Seven of Cups หมายถึง ความสับสน ตัวเลือกเยอะ เกิดขึ้นได้จากความรู้สึกที่มีมากมายเกินความจำเป็น หรือแม้แต่มีข้อเสนอเข้ามาเยอะมากจนตัดสินใจไม่ถูก",
        "Eight of Cups หมายถึง การจากลา ทอดทิ้ง การเดินหนีจากสิ่งที่ทำให้ผิดหวัง หรือเรื่องนั้นๆ ได้จบลงแล้ว ได้เวลาก้าวต่อไป",
        "Nine of Cups หมายถึง สมหวัง ความหวังเป็นจริง สิ่งที่อยากได้กำลังจะกลายเป็นจริง นั่งรอได้เลย",
        "Ten of Cups หมายถึง ความสุข ครอบครัว การมีทุกอย่างพร้อม มีความสุขแบบสุดๆ",
        "Page of Cups หมายถึง ความสนุก ชอบเข้าสังคม ได้พบเจอกับคนมากหน้าหลายตา หรืออาจได้รับข่าวสารบางอย่าง",
        "Knight of Cups หมายถึง นักสู้ นักฝัน การขอร้อง ขอแต่งงาน อยากได้สิ่งใดก็ต้องออกไปฝ่าฟันเอามาให้ได้",
        "Queen of Cups หมายถึง สัญชาตญาณดี การพิจารณา หากต้องตัดสินใจอะไรก็ตาม ต้องคิดทบทวนอย่างรอบคอบ",
        "King of Cups หมายถึง ฉลาด สุขุม อดทน แม้ว่าจะต้องเจอกับเหตุการณ์ไม่มั่นคงใดๆ ก็ต้องวางตัวหนักแน่น ใช้เหตุผลมากกว่าอารมณ์",

        "Ace of Pentacles หมายถึง เงินทอง ความสำเร็จ การเริ่มต้น จุดเริ่มต้นของความมั่นคงมาถึงแล้ว เตรียมรับให้ดี",
        "Two of Pentacles หมายถึง การตัดสินใจ การเลือกด้วยความระมัดระวัง และยังหมายถึงการหมุนเงินอีกด้วย",
        "Three of Pentacles หมายถึง การแสดงความสามารถออกมาให้คนอื่นเห็น การมุ่งมั่นสร้างฐานะ",
        "Four of Pentacles หมายถึง ความมั่นคง ความร่ำรวย เก็บเงินเก่งจนสร้างความมั่นคงให้ชีวิตได้ดี",
        "Five of Pentacles หมายถึง มีปัญหาทางการเงิน การแยกจากกัน ความลำบาก ช่วยเหลือคนอื่นไม่ได้ และคนอื่นก็ไม่ได้ช่วยเหลือเช่นกัน",
        "Six of Pentacles หมายถึง ความมีน้ำใจ การแบ่งปัน แต่ก็เป็นการแบ่งปันที่ไม่เท่าเทียม ฝ่ายใดฝ่ายหนึ่งได้มากกว่า",
        "Seven of Pentacles หมายถึง การลงทุน รางวัลตอบแทน ได้รับผลตอบแทนของการทำงานที่ผ่านมา",
        "Eight of Pentacles หมายถึง ขยัน ทุ่มเท ขยันทำงานสร้างเงินทองและความมั่นคงของฐานะ ต้องทำงานถึงจะได้เงิน",
        "Nine of Pentacles หมายถึง มั่นคง มั่งคั่ง มีเงินเก็บมากมาย มีความสบายพร้อมทุกด้าน",
        "Ten of Pentacles หมายถึง การแต่งงาน ได้รับมรดก ชีวิตดีๆ ครอบครัวดี เงินดี ชีวิตที่พร้อมทุกๆ ด้าน",
        "Page of Pentacles หมายถึง ได้รับข้อเสนอ ได้รับโอกาสดีๆ แม้จะเป็นเพียงการเริ่มต้นเล็กๆ ก็ตาม",
        "Knight of Pentacles หมายถึง ความละเอียด การใส่ใจ รักอิสระ กล้าออกไปหาเส้นทางใหม่ๆ",
        "Queen of Pentacles หมายถึง ใจกว้าง ความอุดมสมบูรณ์ การคิดพิจารณาอย่างละเอียดรอบคอบ",
        "King of Pentacles หมายถึง ประสบความสำเร็จ ร่ำรวย มีเงินทองมากมาย หวังสิ่งใดก็จะได้สิ่งนั้น ไม่ขัดสน ไม่ลำบาก",

        "Ace of Swords หมายถึง ความสำเร็จ จุดเริ่มต้นของสิ่งใหม่ๆ มีคนยื่นโอกาสดีๆ เข้ามาให้",
        "Two of Swords หมายถึง การจนมุม ขยับตัวไม่ได้ เลือกไม่ได้ว่าต้องทำอย่างไร ตัดสินใจไม่ได้",
        "Three of Swords หมายถึง ความเสียใจ ใจสลาย ต้องเจอเรื่องผิดหวัง และยังหมายถึงเจอฝนถล่มก็ได้",
        "Four of Swords หมายถึง การพักผ่อน นิ่งเฉย โดนกดดันจากรอบตัวจนไม่อาจตัดสินใจอะไรได้",
        "Five of Swords หมายถึง ปัญหาต่างๆ ที่ถาโถมเข้ามา การไม่ลงรอยกันกับคนรอบตัว รวมไปถึงการสูญเสียบางสิ่งบางอย่าง",
        "Six of Swords หมายถึง การละเลยปัญหา เพิกเฉยต่อปัญหา จนบานปลายและทำให้ตกอยู่ในสภาวะจำยอม หรือต้องปล่อยตัวเองไปตามน้ำ",
        "Seven of Swords หมายถึง การขโมย ทำเรื่องผิดกฎหมายต่างๆ รวมถึงงานที่มีเยอะมากจนล้นมือทำไม่ทัน",
        "Eight of Swords หมายถึง การถูกบีบบังคับจากสถานการณ์ต่างๆ รอบตัวจนไม่อาจขยับตัวทำอะไรได้ หรือถูกปิดหูปิดตา",
        "Nine of Swords หมายถึง ความเครียด ความกังวล ปวดหัว คิดมาก รุนแรงถึงขั้นนอนไม่หลับ",
        "Ten of Swords หมายถึง จุดจบ สิ้นสุด เรื่องเครียดและปวดหัวต่างๆ จะจบลงในไม่ช้า",
        "Page of Swords หมายถึง การใช้สัญชาตญาณในการตัดสินใจ เชื่อมั่นในตัวเอง และต้องอดทนเอาไว้แล้วจะชนะอุปสรรคต่างๆ ได้",
        "Knight of Swords หมายถึง การต่อสู้ ฝ่าฟัน ศัตรู ต้องออกแรงค่อนข้างเยอะ ต้องเหนื่อย ต้องสู้ แล้วถึงจะได้ในสิ่งที่ต้องการ",
        "Queen of Swords หมายถึง ความอิสระเสรี ความตรงไปตรงมา ความเด็ดเดี่ยว จัดการสิ่งใดด้วยความเด็ดขาด ไม่ลังเล",
        "King of Swords หมายถึง ความมุ่งมั่น ความเด็ดเดี่ยว การคิดวิเคราะห์ หากเจออุปสรรคใดๆ ต้องใช้ทั้ง 3 อย่างเพื่อผ่านไปให้ได้",

        "Ace of Wands หมายถึง การได้รับข่าวสาร ได้รับโอกาส หรือได้เริ่มต้นกิจกรรมบางอย่าง",
        "Two of Wands หมายถึง การวางแผนการต่างๆ ในอนาคต ความกล้าหาญ กล้าจะก้าวออกไปยังโลกอันไม่คุ้นเคย",
        "Three of Wands หมายถึง การเดินทางไปยังที่ที่ไม่คุ้นเคย ทำในสิ่งที่กลัว หรือการมองการณ์ไกล",
        "Four of Wands หมายถึง การเฉลิมฉลอง การแต่งงาน หรือความสุขสมหวัง",
        "Five of Wands หมายถึง การแข่งขันกับคนหมู่มาก อุปสรรคเยอะมาก หรือทะเลาะเบาะแว้ง ไม่ลงรอยกัน",
        "Six of Wands หมายถึง ชัยชนะ ความสำเร็จ การเฉลิมฉลองความสำเร็จ",
        "Seven of Wands หมายถึง ความยึดมั่น การปกป้องตัวเอง อุปสรรคหรือภาระที่ถาโถมเข้ามาพร้อมๆ กัน",
        "Eight of Wands หมายถึง ข่าวสาร การติดต่อสื่อสารจากทางไกล หรือมีโอกาสได้เดินทางไกล",
        "Nine of Wands หมายถึง ความเข้มแข็งและมุ่งมั่น การตัดสินใจเลือกสิ่งสำคัญ การป้องกันตัวเอง",
        "Ten of Wands หมายถึง ภาระหน้าที่หรือการทำงานมากเกินไปจนไม่สามารถขยับตัวไปทำสิ่งอื่นๆ ได้",
        "Page of Wands หมายถึง ได้รับข่าวสาร กระตือรือร้น กล้าหาญ มุ่งมั่นกับสิ่งที่เลือกแล้ว",
        "Knight of Wands หมายถึง มั่นใจในตัวเอง ชอบเสี่ยง การลงมือทำสิ่งต่างๆ ด้วยความรวดเร็วว่องไว",
        "Queen of Wands หมายถึง การมีความคิดสร้างสรรค์ การเป็นตัวของตัวเอง",
        "King of Wands หมายถึง การมีอำนาจ มีไอเดียใหม่ๆ กล้าหาญ ความมั่นคงและน่าเชื่อถือ"
    ];

    public Random random = new Random();

    public bool Execute()
    {
        string username = CPH.GetGlobalVar<string>("user");
        
        string primaryResult = primaryCards[random.Next(0,primaryCards.Length)];
        string secondaryResult = secondaryCards[random.Next(0,secondaryCards.Length)];

        // CPH.SendMessage("[C#] Passed");
        // CPH.SendMessage($"${username} Number: {random.Next(1,primaryCards.Length)}");
        CPH.SendMessage($"คุณ {username} [\"ได้ไพ่หลักคือ\"] : {primaryResult} [\"ได้ไพ่รองคือ\"] : {secondaryResult}");

        // CPH.ObsSetImageSourceFile("Scence", "Test Image", "E:\\0KCE Studio\\Sony Vegas\\2Picture\\SquareDuck.png");
        // CPH.Wait(3000);
        // CPH.ObsSetImageSourceFile("Scence", "Test Image", "E:\\0KCE Studio\\Sony Vegas\\2Picture\\jesusinneed.png");
        // CPH.Wait(3000);
        // CPH.ObsSetImageSourceFile("Scence", "Test Image", "");
        
        return true;
    }
}