import { TarotCard } from "../types/Tarot.type";

export const MajorCards: TarotCard[] = [
    {
        id: 0,
        name: "The Fool",
        description: "การเริ่มต้นอะไรใหม่ๆ การเสี่ยงอันตราย หากว่าเปิดได้ไพ่ใบนี้แล้วล่ะก็ เส้นทางใหม่ที่จะเดินไปอาจมีความเสี่ยง แต่เป็นความเสี่ยงที่ตัวเองต้องการ รู้ว่าเสี่ยงแต่คงต้องขอลอง"
    },
    {
        id: 1,
        name: "The Magician",
        description: "ความทะเยอทะยาน การลงมือทำ ไพ่บอกว่าตัวคุณเองว่าคุณเก่งมาก อยากทำอะไรก็ลุยให้เต็มที่เลย เพราะไฟในตัวมีเยอะพอๆ กับความสามารถ ดังนั้นลุยได้เลยไม่ต้องยั้ง"
    },
    {
        id: 2,
        name: "The High Priestess",
        description: "ความฉลาด มีความรู้ความสามารถ เป็นตัวแทนของคนเก่งมากความสามารถ แต่มักซ่อนสิ่งนั้นเอาไว้ภายในรูปลักษณ์นิ่งเงียบที่แสดงให้ภายนอกได้เห็น"
    },
    {
        id: 3,
        name: "The Empress",
        description: "ความอุดมสมบูรณ์ ความเป็นแม่ เปิดได้ไพ่ใบนี้บอกเลยว่าจะเจอแต่ความสุขความสบาย เงินทองมั่งมี หรืออาจหมายถึงโอกาสตั้งครรภ์ได้ด้วย"
    },
    {
        id: 4,
        name: "The Emperor",
        description: "การมีอำนาจ ชอบสั่ง และไม่ยอมใคร คุณอาจอยู่ในสถานการณ์ที่ต้องยอมทำตามผู้ใหญ่ ถูกบังคับจากคนมีอำนาจมากกว่าก็เป็นได้ และยังหมายถึงความมั่นคงได้อีกด้วย"
    },
    {
        id: 5,
        name: "The Hierophant",
        description: "การมีความรู้ การแต่งงาน การรวมเป็นหนึ่ง พระคือตัวแทนของผู้มีความรู้และยังเป็นตัวแทนในการแต่งงานรวมเป็นครอบครัวเดียวกัน อาจหมายถึงการเป็นที่พึ่งพาของคนอื่นๆ"
    },
    {
        id: 6,
        name: "The Lovers",
        description: "ความรัก การตัดสินใจ ได้พบเจอความรัก หรือต้องตัดสินใจเลือกสิ่งใดสิ่งหนึ่ง"
    },
    {
        id: 7,
        name: "The Chariot",
        description: "ความแน่วแน่ มุ่งมั่น ขยัน ทุ่มเท เมื่อเจอไพ่ใบนี้ คุณต้องทำตัวให้แข็งแกร่งยิ่งกว่าม้าศึกถึงจะประสบความสำเร็จในสิ่งที่ทำ"
    },
    {
        id: 8,
        name: "Strength",
        description: "ความแข็งแกร่ง บริหารจัดการเก่ง ไพ่นี้คือตัวแทนของหญิงสาวสุดแกร่ง มีอะไรเข้ามาก็ไม่อาจทำอะไรเธอได้ แถมยังจัดการสิ่งต่างๆ ได้เป็นอย่างดีอีกด้วย"
    },
    {
        id: 9,
        name: "The Hermit",
        description: "ความสันโดษ โดดเดี่ยว วิเคราะห์ เมื่อเจอไพ่ใบนี้ก็คงเลี่ยงไม่พ้นการอยู่ตัวคนเดียว การใช้เวลารักษาเยียวยาจิตใจ หรือแม้แต่การใช้เวลาเพื่อคิดวิเคราะห์สิ่งต่างๆ รอบตัว อย่าได้ใจร้อนทำสิ่งใดเด็ดขาด"
    },
    {
        id: 10,
        name: "The Wheel of Fortune",
        description: "โชคชะตา เปลี่ยนแปลง คุณต้องเตรียมตัวให้ดี เพราะมีโอกาสเกิดเรื่องที่ไม่คาดฝันได้ มีการเปลี่ยนแปลงที่เราไม่อาจขัดขวางได้ อาจจะเป็นเรื่องดีหรือไม่ดีก็ได้เช่นกัน"
    },
    {
        id: 11,
        name: "Justice",
        description: "การตัดสินใจ เท่าเทียม กฎหมาย หากเปิดเจอไพ่นี้แสดงว่าคุณจะได้รับความยุติธรรม มีการตัดสินใจที่ก่อให้เกิดความเท่าเทียม หรืออาจจะเจอกับเรื่องราวเกี่ยวกับกฎหมายก็ได้เช่นกัน"
    },
    {
        id: 12,
        name: "The Hanged Man",
        description: "การรอคอย เสียสละ คุณอาจได้เจอกับสถานการณ์ที่ไม่อาจตัดสินใจทำอะไรได้ ต้องอยู่นิ่งๆ ต้องรอคอย หรืออาจจะต้องเสียสละความสุขส่วนตัวบางอย่าง"
    },
    {
        id: 13,
        name: "Death",
        description: "การเปลี่ยนแปลง เกิดใหม่ เรื่องร้ายๆ จะกลายเป็นดี สิ่งต่างๆ ที่ว่าร้ายแรงแล้วจะเริ่มเปลี่ยนแปลงไปในทางที่ดีขึ้นทีละนิด"
    },
    {
        id: 14,
        name: "Temperance",
        description: "การต่อรอง ผสมผสาน สมดุล ไพ่อยากแนะนำให้คุณสร้างความสมดุลให้ชีวิต ต้องต่อรองและยอมอ่อนข้อบ้างเพื่อให้ได้สิ่งที่ต้องการ"
    },
    {
        id: 15,
        name: "The Devil",
        description: "การควบคุม ผูกมัด ไร้ความหวัง ระวังให้ดี เมื่อไพ่ใบนี้ปรากฏขึ้นมา เพราะคุณอาจเจอกับการควบคุม ถูกผูกมัดโดยไม่เต็มใจจนทำให้หมดพลังใจและหมดความหวัง"
    },
    {
        id: 16,
        name: "The Tower",
        description: "การเปลี่ยนแปลงกะทันหัน การทะเลาะเบาะแว้ง ต้องเตรียมใจให้ดี เพราะอาจเจอเรื่องไม่คาดฝัน ได้รับข่าวสารที่ไม่ทันได้เตรียมใจ หรือเกิดเรื่องบาดหมางใหญ่โตกับคนรอบตัว"
    },
    {
        id: 17,
        name: "The Star",
        description: "ความหวัง ความสงบ แม้ฟ้าจะมืดมิด แต่หากไพ่ใบนี้โผล่ขึ้นมาก็เหมือนกับมีความหวังจากดวงดาวปรากฏขึ้น ควรทำตัวให้สงบเยือกเย็นเอาไว้"
    },
    {
        id: 18,
        name: "The Moon",
        description: "ความกลัว ภาพลวงตา บางครั้งความกลัวก็อาจคืบคลานเข้ามาหาคุณแบบไม่รู้ตัว แต่ไพ่อาจบอกให้พิจารณาให้ดีว่าสิ่งนั้นน่ากลัวจริงๆ หรือเป็นเพียงภาพลวงตา"
    },
    {
        id: 19,
        name: "The Sun",
        description: "การเติบโต แสงสว่าง มีชีวิตชีวา ไพ่ที่เป็นตัวแทนของความร้อนแรงและสดใส และเร็วๆ นี้อาจมีเรื่องดีๆ เข้ามาเซอร์ไพรส์ก็เป็นได้"
    },
    {
        id: 20,
        name: "Judgement",
        description: "การตัดสินใจ โอกาสครั้งที่สอง จะมีเรื่องสำคัญมากๆ เข้ามาให้ต้องตัดสินใจ ต้องปล่อยอดีตให้ผ่านไปเพื่อให้สิ่งใหม่ๆ ได้เข้ามาแทน"
    },
    {
        id: 21,
        name: "The World",
        description: "ความสำเร็จ ความสมบูรณ์ ถือเป็นอีกหนึ่งใบดีๆ อีกหนึ่งใบ มีความสำเร็จเกิดขึ้น ชีวิตเติมเต็มมากๆ ด้วย"
    }
]

export const MinorCards: TarotCard[] = [
    {
        id: 22,
        name: "Ace of Cups",
        description: "ความรัก การเริ่มต้น การมอบสิ่งดีๆ ให้กับอีกฝ่ายหรืออาจจะเป็นฝ่ายได้รับสิ่งดีๆ จากผู้อื่น"
    },
    {
        id: 23,
        name: "Two of Cups",
        description: "คนรัก คู่รัก การมอบความรักให้กันและกัน ถ้าชอบใครอยู่อาจมีโอกาสสมหวัง"
    },
    {
        id: 24,
        name: "Three of Cups",
        description: "การเฉลิมฉลอง ปาร์ตี้กับเพื่อนๆ มีความรักแบบเพื่อนฝูง แฮปปี้มีความสุข"
    },
    {
        id: 25,
        name: "Four of Cups",
        description: "การหยุดนิ่ง ความเบื่อหน่าย แม้จะมีความสุข มีสิ่งดีๆ รายล้อม แต่กลับเบื่อหน่ายเพราะอยู่แต่ในกรอบเดิมๆ"
    },
    {
        id: 26,
        name: "Five of Cups",
        description: "การสูญเสีย ความเศร้า เหมือนถ้วยที่ล้มลง ความรู้สึกสิ้นหวัง ความหวังพังทลาย"
    },
    {
        id: 27,
        name: "Six of Cups",
        description: "ความสงบสุข มีคนมาเยี่ยม อาจได้รับเซอร์ไพรส์จากคนอื่น มีการมาหาแบบไม่ทันตั้งตัว ได้รับของฝาก"
    },
    {
        id: 28,
        name: "Seven of Cups",
        description: "ความสับสน ตัวเลือกเยอะ เกิดขึ้นได้จากความรู้สึกที่มีมากมายเกินความจำเป็น หรือแม้แต่มีข้อเสนอเข้ามาเยอะมากจนตัดสินใจไม่ถูก"
    },
    {
        id: 29,
        name: "Eight of Cups",
        description: "การจากลา ทอดทิ้ง การเดินหนีจากสิ่งที่ทำให้ผิดหวัง หรือเรื่องนั้นๆ ได้จบลงแล้ว ได้เวลาก้าวต่อไป"
    },
    {
        id: 30,
        name: "Nine of Cups",
        description: "สมหวัง ความหวังเป็นจริง สิ่งที่อยากได้กำลังจะกลายเป็นจริง นั่งรอได้เลย"
    },
    {
        id: 31,
        name: "Ten of Cups",
        description: "ความสุข ครอบครัว การมีทุกอย่างพร้อม มีความสุขแบบสุดๆ"
    },
    {
        id: 32,
        name: "Page of Cups",
        description: "ความสนุก ชอบเข้าสังคม ได้พบเจอกับคนมากหน้าหลายตา หรืออาจได้รับข่าวสารบางอย่าง"
    },
    {
        id: 33,
        name: "Knight of Cups",
        description: "นักสู้ นักฝัน การขอร้อง ขอแต่งงาน อยากได้สิ่งใดก็ต้องออกไปฝ่าฟันเอามาให้ได้"
    },
    {
        id: 34,
        name: "Queen of Cups",
        description: "สัญชาตญาณดี การพิจารณา หากต้องตัดสินใจอะไรก็ตาม ต้องคิดทบทวนอย่างรอบคอบ"
    },
    {
        id: 35,
        name: "King of Cups",
        description: "ฉลาด สุขุม อดทน แม้ว่าจะต้องเจอกับเหตุการณ์ไม่มั่นคงใดๆ ก็ต้องวางตัวหนักแน่น ใช้เหตุผลมากกว่าอารมณ์"
    },
    {
        id: 36,
        name: "Ace of Pentacles",
        description: "เงินทอง ความสำเร็จ การเริ่มต้น จุดเริ่มต้นของความมั่นคงมาถึงแล้ว เตรียมรับให้ดี"
    },
    {
        id: 37,
        name: "Two of Pentacles",
        description: "การตัดสินใจ การเลือกด้วยความระมัดระวัง และยังหมายถึงการหมุนเงินอีกด้วย"
    },
    {
        id: 38,
        name: "Three of Pentacles",
        description: "การแสดงความสามารถออกมาให้คนอื่นเห็น การมุ่งมั่นสร้างฐานะ"
    },
    {
        id: 39,
        name: "Four of Pentacles",
        description: "ความมั่นคง ความร่ำรวย เก็บเงินเก่งจนสร้างความมั่นคงให้ชีวิตได้ดี"
    },
    {
        id: 40,
        name: "Five of Pentacles",
        description: "มีปัญหาทางการเงิน การแยกจากกัน ความลำบาก ช่วยเหลือคนอื่นไม่ได้ และคนอื่นก็ไม่ได้ช่วยเหลือเช่นกัน"
    },
    {
        id: 41,
        name: "Six of Pentacles",
        description: "ความมีน้ำใจ การแบ่งปัน แต่ก็เป็นการแบ่งปันที่ไม่เท่าเทียม ฝ่ายใดฝ่ายหนึ่งได้มากกว่า"
    },
    {
        id: 42,
        name: "Seven of Pentacles",
        description: "การลงทุน รางวัลตอบแทน ได้รับผลตอบแทนของการทำงานที่ผ่านมา"
    },
    {
        id: 43,
        name: "Eight of Pentacles",
        description: "ขยัน ทุ่มเท ขยันทำงานสร้างเงินทองและความมั่นคงของฐานะ ต้องทำงานถึงจะได้เงิน"
    },
    {
        id: 44,
        name: "Nine of Pentacles",
        description: "มั่นคง มั่งคั่ง มีเงินเก็บมากมาย มีความสบายพร้อมทุกด้าน"
    },
    {
        id: 45,
        name: "Ten of Pentacles",
        description: "การแต่งงาน ได้รับมรดก ชีวิตดีๆ ครอบครัวดี เงินดี ชีวิตที่พร้อมทุกๆ ด้าน"
    },
    {
        id: 46,
        name: "Page of Pentacles",
        description: "ได้รับข้อเสนอ ได้รับโอกาสดีๆ แม้จะเป็นเพียงการเริ่มต้นเล็กๆ ก็ตาม"
    },
    {
        id: 47,
        name: "Knight of Pentacles",
        description: "ความละเอียด การใส่ใจ รักอิสระ กล้าออกไปหาเส้นทางใหม่ๆ"
    },
    {
        id: 48,
        name: "Queen of Pentacles",
        description: "ใจกว้าง ความอุดมสมบูรณ์ การคิดพิจารณาอย่างละเอียดรอบคอบ"
    },
    {
        id: 49,
        name: "King of Pentacles",
        description: "ประสบความสำเร็จ ร่ำรวย มีเงินทองมากมาย หวังสิ่งใดก็จะได้สิ่งนั้น ไม่ขัดสน ไม่ลำบาก"
    },
    {
        id: 50,
        name: "Ace of Swords",
        description: "ความสำเร็จ จุดเริ่มต้นของสิ่งใหม่ๆ มีคนยื่นโอกาสดีๆ เข้ามาให้"
    },
    {
        id: 51,
        name: "Two of Swords",
        description: "การจนมุม ขยับตัวไม่ได้ เลือกไม่ได้ว่าต้องทำอย่างไร ตัดสินใจไม่ได้"
    },
    {
        id: 52,
        name: "Three of Swords",
        description: "ความเสียใจ ใจสลาย ต้องเจอเรื่องผิดหวัง และยังหมายถึงเจอฝนถล่มก็ได้"
    },
    {
        id: 53,
        name: "Four of Swords",
        description: "การพักผ่อน นิ่งเฉย โดนกดดันจากรอบตัวจนไม่อาจตัดสินใจอะไรได้"
    },
    {
        id: 54,
        name: "Five of Swords",
        description: "ปัญหาต่างๆ ที่ถาโถมเข้ามา การไม่ลงรอยกันกับคนรอบตัว รวมไปถึงการสูญเสียบางสิ่งบางอย่าง"
    },
    {
        id: 55,
        name: "Six of Swords",
        description: "การละเลยปัญหา เพิกเฉยต่อปัญหา จนบานปลายและทำให้ตกอยู่ในสภาวะจำยอม หรือต้องปล่อยตัวเองไปตามน้ำ"
    },
    {
        id: 56,
        name: "Seven of Swords",
        description: "การขโมย ทำเรื่องผิดกฎหมายต่างๆ รวมถึงงานที่มีเยอะมากจนล้นมือทำไม่ทัน"
    },
    {
        id: 57,
        name: "Eight of Swords",
        description: "การถูกบีบบังคับจากสถานการณ์ต่างๆ รอบตัวจนไม่อาจขยับตัวทำอะไรได้ หรือถูกปิดหูปิดตา"
    },
    {
        id: 58,
        name: "Nine of Swords",
        description: "ความเครียด ความกังวล ปวดหัว คิดมาก รุนแรงถึงขั้นนอนไม่หลับ"
    },
    {
        id: 59,
        name: "Ten of Swords",
        description: "จุดจบ สิ้นสุด เรื่องเครียดและปวดหัวต่างๆ จะจบลงในไม่ช้า"
    },
    {
        id: 60,
        name: "Page of Swords",
        description: "การใช้สัญชาตญาณในการตัดสินใจ เชื่อมั่นในตัวเอง และต้องอดทนเอาไว้แล้วจะชนะอุปสรรคต่างๆ ได้"
    },
    {
        id: 61,
        name: "Knight of Swords",
        description: "การต่อสู้ ฝ่าฟัน ศัตรู ต้องออกแรงค่อนข้างเยอะ ต้องเหนื่อย ต้องสู้ แล้วถึงจะได้ในสิ่งที่ต้องการ"
    },
    {
        id: 62,
        name: "Queen of Swords",
        description: "ความอิสระเสรี ความตรงไปตรงมา ความเด็ดเดี่ยว จัดการสิ่งใดด้วยความเด็ดขาด ไม่ลังเล"
    },
    {
        id: 63,
        name: "King of Swords",
        description: "ความมุ่งมั่น ความเด็ดเดี่ยว การคิดวิเคราะห์ หากเจออุปสรรคใดๆ ต้องใช้ทั้ง 3 อย่างเพื่อผ่านไปให้ได้"
    },
    {
        id: 64,
        name: "Ace of Wands",
        description: "การได้รับข่าวสาร ได้รับโอกาส หรือได้เริ่มต้นกิจกรรมบางอย่าง"
    },
    {
        id: 65,
        name: "Two of Wands",
        description: "การวางแผนการต่างๆ ในอนาคต ความกล้าหาญ กล้าจะก้าวออกไปยังโลกอันไม่คุ้นเคย"
    },
    {
        id: 66,
        name: "Three of Wands",
        description: "การเดินทางไปยังที่ที่ไม่คุ้นเคย ทำในสิ่งที่กลัว หรือการมองการณ์ไกล"
    },
    {
        id: 67,
        name: "Four of Wands",
        description: "การเฉลิมฉลอง การแต่งงาน หรือความสุขสมหวัง"
    },
    {
        id: 68,
        name: "Five of Wands",
        description: "การแข่งขันกับคนหมู่มาก อุปสรรคเยอะมาก หรือทะเลาะเบาะแว้ง ไม่ลงรอยกัน"
    },
    {
        id: 69,
        name: "Six of Wands",
        description: "ชัยชนะ ความสำเร็จ การเฉลิมฉลองความสำเร็จ"
    },
    {
        id: 70,
        name: "Seven of Wands",
        description: "ความยึดมั่น การปกป้องตัวเอง อุปสรรคหรือภาระที่ถาโถมเข้ามาพร้อมๆ กัน"
    },
    {
        id: 71,
        name: "Eight of Wands",
        description: "ข่าวสาร การติดต่อสื่อสารจากทางไกล หรือมีโอกาสได้เดินทางไกล"
    },
    {
        id: 72,
        name: "Nine of Wands",
        description: "ความเข้มแข็งและมุ่งมั่น การตัดสินใจเลือกสิ่งสำคัญ การป้องกันตัวเอง"
    },
    {
        id: 73,
        name: "Ten of Wands",
        description: "ภาระหน้าที่หรือการทำงานมากเกินไปจนไม่สามารถขยับตัวไปทำสิ่งอื่นๆ ได้"
    },
    {
        id: 74,
        name: "Page of Wands",
        description: "ได้รับข่าวสาร กระตือรือร้น กล้าหาญ มุ่งมั่นกับสิ่งที่เลือกแล้ว"
    },
    {
        id: 75,
        name: "Knight of Wands",
        description: "มั่นใจในตัวเอง ชอบเสี่ยง การลงมือทำสิ่งต่างๆ ด้วยความรวดเร็วว่องไว"
    },
    {
        id: 76,
        name: "Queen of Wands",
        description: "การมีความคิดสร้างสรรค์ การเป็นตัวของตัวเอง"
    },
    {
        id: 77,
        name: "King of Wands",
        description: "การมีอำนาจ มีไอเดียใหม่ๆ กล้าหาญ ความมั่นคงและน่าเชื่อถือ"
    }
]